---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.ConditionType
source: html/5acc523b-0e2a-1b49-6139-304522c0acf5.htm
---
# Autodesk.Revit.DB.Mechanical.ConditionType

An enumerated type listing all the possible condition types for a space object.

## Syntax (C#)
```csharp
public enum ConditionType
```